virtualabs/cutcutgo/src/packs/ATSAMG55J19_DFP/component/twi.h
/*
 * Component description for TWI
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2021-07-26T14:35:51Z */
#ifndef _SAMG55_TWI_COMPONENT_H_
#define _SAMG55_TWI_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR TWI                                          */
/* ************************************************************************** */

/* -------- TWI_CR : (TWI Offset: 0x00) ( /W 32) Control Register -------- */
#define TWI_CR_START_Pos                      _U_(0)                                               /**< (TWI_CR) Send a START Condition Position */
#define TWI_CR_START_Msk                      (_U_(0x1) << TWI_CR_START_Pos)                       /**< (TWI_CR) Send a START Condition Mask */
#define TWI_CR_START(value)                   (TWI_CR_START_Msk & ((value) << TWI_CR_START_Pos))  
#define TWI_CR_STOP_Pos                       _U_(1)                                               /**< (TWI_CR) Send a STOP Condition Position */
#define TWI_CR_STOP_Msk                       (_U_(0x1) << TWI_CR_STOP_Pos)                        /**< (TWI_CR) Send a STOP Condition Mask */
#define TWI_CR_STOP(value)                    (TWI_CR_STOP_Msk & ((value) << TWI_CR_STOP_Pos))    
#define TWI_CR_MSEN_Pos                       _U_(2)                                               /**< (TWI_CR) TWI Master Mode Enabled Position */
#define TWI_CR_MSEN_Msk                       (_U_(0x1) << TWI_CR_MSEN_Pos)                        /**< (TWI_CR) TWI Master Mode Enabled Mask */
#define TWI_CR_MSEN(value)                    (TWI_CR_MSEN_Msk & ((value) << TWI_CR_MSEN_Pos))    
#define TWI_CR_MSDIS_Pos                      _U_(3)                                               /**< (TWI_CR) TWI Master Mode Disabled Position */
#define TWI_CR_MSDIS_Msk                      (_U_(0x1) << TWI_CR_MSDIS_Pos)                       /**< (TWI_CR) TWI Master Mode Disabled Mask */
#define TWI_CR_MSDIS(value)                   (TWI_CR_MSDIS_Msk & ((value) << TWI_CR_MSDIS_Pos))  
#define TWI_CR_SVEN_Pos                       _U_(4)                                               /**< (TWI_CR) TWI Slave Mode Enabled Position */
#define TWI_CR_SVEN_Msk                       (_U_(0x1) << TWI_CR_SVEN_Pos)                        /**< (TWI_CR) TWI Slave Mode Enabled Mask */
#define TWI_CR_SVEN(value)                    (TWI_CR_SVEN_Msk & ((value) << TWI_CR_SVEN_Pos))    
#define TWI_CR_SVDIS_Pos                      _U_(5)                                               /**< (TWI_CR) TWI Slave Mode Disabled Position */
#define TWI_CR_SVDIS_Msk                      (_U_(0x1) << TWI_CR_SVDIS_Pos)                       /**< (TWI_CR) TWI Slave Mode Disabled Mask */
#define TWI_CR_SVDIS(value)                   (TWI_CR_SVDIS_Msk & ((value) << TWI_CR_SVDIS_Pos))  
#define TWI_CR_QUICK_Pos                      _U_(6)                                               /**< (TWI_CR) SMBus Quick Command Position */
#define TWI_CR_QUICK_Msk                      (_U_(0x1) << TWI_CR_QUICK_Pos)                       /**< (TWI_CR) SMBus Quick Command Mask */
#define TWI_CR_QUICK(value)                   (TWI_CR_QUICK_Msk & ((value) << TWI_CR_QUICK_Pos))  
#define TWI_CR_SWRST_Pos                      _U_(7)                                               /**< (TWI_CR) Software Reset Position */
#define TWI_CR_SWRST_Msk                      (_U_(0x1) << TWI_CR_SWRST_Pos)                       /**< (TWI_CR) Software Reset Mask */
#define TWI_CR_SWRST(value)                   (TWI_CR_SWRST_Msk & ((value) << TWI_CR_SWRST_Pos))  
#define TWI_CR_HSEN_Pos                       _U_(8)                                               /**< (TWI_CR) TWI High-Speed Mode Enabled Position */
#define TWI_CR_HSEN_Msk                       (_U_(0x1) << TWI_CR_HSEN_Pos)                        /**< (TWI_CR) TWI High-Speed Mode Enabled Mask */
#define TWI_CR_HSEN(value)                    (TWI_CR_HSEN_Msk & ((value) << TWI_CR_HSEN_Pos))    
#define TWI_CR_HSDIS_Pos                      _U_(9)                                               /**< (TWI_CR) TWI High-Speed Mode Disabled Position */
#define TWI_CR_HSDIS_Msk                      (_U_(0x1) << TWI_CR_HSDIS_Pos)                       /**< (TWI_CR) TWI High-Speed Mode Disabled Mask */
#define TWI_CR_HSDIS(value)                   (TWI_CR_HSDIS_Msk & ((value) << TWI_CR_HSDIS_Pos))  
#define TWI_CR_SMBEN_Pos                      _U_(10)                                              /**< (TWI_CR) SMBus Mode Enabled Position */
#define TWI_CR_SMBEN_Msk                      (_U_(0x1) << TWI_CR_SMBEN_Pos)                       /**< (TWI_CR) SMBus Mode Enabled Mask */
#define TWI_CR_SMBEN(value)                   (TWI_CR_SMBEN_Msk & ((value) << TWI_CR_SMBEN_Pos))  
#define TWI_CR_SMBDIS_Pos                     _U_(11)                                              /**< (TWI_CR) SMBus Mode Disabled Position */
#define TWI_CR_SMBDIS_Msk                     (_U_(0x1) << TWI_CR_SMBDIS_Pos)                      /**< (TWI_CR) SMBus Mode Disabled Mask */
#define TWI_CR_SMBDIS(value)                  (TWI_CR_SMBDIS_Msk & ((value) << TWI_CR_SMBDIS_Pos))
#define TWI_CR_PECEN_Pos                      _U_(12)                                              /**< (TWI_CR) Packet Error Checking Enable Position */
#define TWI_CR_PECEN_Msk                      (_U_(0x1) << TWI_CR_PECEN_Pos)                       /**< (TWI_CR) Packet Error Checking Enable Mask */
#define TWI_CR_PECEN(value)                   (TWI_CR_PECEN_Msk & ((value) << TWI_CR_PECEN_Pos))  
#define TWI_CR_PECDIS_Pos                     _U_(13)                                              /**< (TWI_CR) Packet Error Checking Disable Position */
#define TWI_CR_PECDIS_Msk                     (_U_(0x1) << TWI_CR_PECDIS_Pos)                      /**< (TWI_CR) Packet Error Checking Disable Mask */
#define TWI_CR_PECDIS(value)                  (TWI_CR_PECDIS_Msk & ((value) << TWI_CR_PECDIS_Pos))
#define TWI_CR_PECRQ_Pos                      _U_(14)                                              /**< (TWI_CR) PEC Request Position */
#define TWI_CR_PECRQ_Msk                      (_U_(0x1) << TWI_CR_PECRQ_Pos)                       /**< (TWI_CR) PEC Request Mask */
#define TWI_CR_PECRQ(value)                   (TWI_CR_PECRQ_Msk & ((value) << TWI_CR_PECRQ_Pos))  
#define TWI_CR_CLEAR_Pos                      _U_(15)                                              /**< (TWI_CR) Bus CLEAR Command Position */
#define TWI_CR_CLEAR_Msk                      (_U_(0x1) << TWI_CR_CLEAR_Pos)                       /**< (TWI_CR) Bus CLEAR Command Mask */
#define TWI_CR_CLEAR(value)                   (TWI_CR_CLEAR_Msk & ((value) << TWI_CR_CLEAR_Pos))  
#define TWI_CR_ACMEN_Pos                      _U_(16)                                              /**< (TWI_CR) Alternative Command Mode Enable Position */
#define TWI_CR_ACMEN_Msk                      (_U_(0x1) << TWI_CR_ACMEN_Pos)                       /**< (TWI_CR) Alternative Command Mode Enable Mask */
#define TWI_CR_ACMEN(value)                   (TWI_CR_ACMEN_Msk & ((value) << TWI_CR_ACMEN_Pos))  
#define TWI_CR_ACMDIS_Pos                     _U_(17)                                              /**< (TWI_CR) Alternative Command Mode Disable Position */
#define TWI_CR_ACMDIS_Msk                     (_U_(0x1) << TWI_CR_ACMDIS_Pos)                      /**< (TWI_CR) Alternative Command Mode Disable Mask */
#define TWI_CR_ACMDIS(value)                  (TWI_CR_ACMDIS_Msk & ((value) << TWI_CR_ACMDIS_Pos))
#define TWI_CR_THRCLR_Pos                     _U_(24)                                              /**< (TWI_CR) Transmit Holding Register Clear Position */
#define TWI_CR_THRCLR_Msk                     (_U_(0x1) << TWI_CR_THRCLR_Pos)                      /**< (TWI_CR) Transmit Holding Register Clear Mask */
#define TWI_CR_THRCLR(value)                  (TWI_CR_THRCLR_Msk & ((value) << TWI_CR_THRCLR_Pos))
#define TWI_CR_LOCKCLR_Pos                    _U_(26)                                              /**< (TWI_CR) Lock Clear Position */
#define TWI_CR_LOCKCLR_Msk                    (_U_(0x1) << TWI_CR_LOCKCLR_Pos)                     /**< (TWI_CR) Lock Clear Mask */
#define TWI_CR_LOCKCLR(value)                 (TWI_CR_LOCKCLR_Msk & ((value) << TWI_CR_LOCKCLR_Pos))
#define TWI_CR_Msk                            _U_(0x0503FFFF)                                      /**< (TWI_CR) Register Mask  */


/* -------- TWI_MMR : (TWI Offset: 0x04) (R/W 32) Master Mode Register -------- */
#define TWI_MMR_IADRSZ_Pos                    _U_(8)                                               /**< (TWI_MMR) Internal Device Address Size Position */
#define TWI_MMR_IADRSZ_Msk                    (_U_(0x3) << TWI_MMR_IADRSZ_Pos)                     /**< (TWI_MMR) Internal Device Address Size Mask */
#define TWI_MMR_IADRSZ(value)                 (TWI_MMR_IADRSZ_Msk & ((value) << TWI_MMR_IADRSZ_Pos))
#define   TWI_MMR_IADRSZ_NONE_Val             _U_(0x0)                                             /**< (TWI_MMR) No internal device address  */
#define   TWI_MMR_IADRSZ_1_BYTE_Val           _U_(0x1)                                             /**< (TWI_MMR) One-byte internal device address  */
#define   TWI_MMR_IADRSZ_2_BYTE_Val           _U_(0x2)                                             /**< (TWI_MMR) Two-byte internal device address  */
#define   TWI_MMR_IADRSZ_3_BYTE_Val           _U_(0x3)                                             /**< (TWI_MMR) Three-byte internal device address  */
#define TWI_MMR_IADRSZ_NONE                   (TWI_MMR_IADRSZ_NONE_Val << TWI_MMR_IADRSZ_Pos)      /**< (TWI_MMR) No internal device address Position  */
#define TWI_MMR_IADRSZ_1_BYTE                 (TWI_MMR_IADRSZ_1_BYTE_Val << TWI_MMR_IADRSZ_Pos)    /**< (TWI_MMR) One-byte internal device address Position  */
#define TWI_MMR_IADRSZ_2_BYTE                 (TWI_MMR_IADRSZ_2_BYTE_Val << TWI_MMR_IADRSZ_Pos)    /**< (TWI_MMR) Two-byte internal device address Position  */
#define TWI_MMR_IADRSZ_3_BYTE                 (TWI_MMR_IADRSZ_3_BYTE_Val << TWI_MMR_IADRSZ_Pos)    /**< (TWI_MMR) Three-byte internal device address Position  */
#define TWI_MMR_MREAD_Pos                     _U_(12)                                              /**< (TWI_MMR) Master Read Direction Position */
#define TWI_MMR_MREAD_Msk                     (_U_(0x1) << TWI_MMR_MREAD_Pos)                      /**< (TWI_MMR) Master Read Direction Mask */
#define TWI_MMR_MREAD(value)                  (TWI_MMR_MREAD_Msk & ((value) << TWI_MMR_MREAD_Pos))
#define TWI_MMR_DADR_Pos                      _U_(16)                                              /**< (TWI_MMR) Device Address Position */
#define TWI_MMR_DADR_Msk                      (_U_(0x7F) << TWI_MMR_DADR_Pos)                      /**< (TWI_MMR) Device Address Mask */
#define TWI_MMR_DADR(value)                   (TWI_MMR_DADR_Msk & ((value) << TWI_MMR_DADR_Pos))  
#define TWI_MMR_Msk                           _U_(0x007F1300)                                      /**< (TWI_MMR) Register Mask  */


/* -------- TWI_SMR : (TWI Offset: 0x08) (R/W 32) Slave Mode Register -------- */
#define TWI_SMR_NACKEN_Pos                    _U_(0)                                               /**< (TWI_SMR) Slave Receiver Data Phase NACK Enable Position */
#define TWI_SMR_NACKEN_Msk                    (_U_(0x1) << TWI_SMR_NACKEN_Pos)                     /**< (TWI_SMR) Slave Receiver Data Phase NACK Enable Mask */
#define TWI_SMR_NACKEN(value)                 (TWI_SMR_NACKEN_Msk & ((value) << TWI_SMR_NACKEN_Pos))
#define TWI_SMR_SMDA_Pos                      _U_(2)                                               /**< (TWI_SMR) SMBus Default Address Position */
#define TWI_SMR_SMDA_Msk                      (_U_(0x1) << TWI_SMR_SMDA_Pos)                       /**< (TWI_SMR) SMBus Default Address Mask */
#define TWI_SMR_SMDA(value)                   (TWI_SMR_SMDA_Msk & ((value) << TWI_SMR_SMDA_Pos))  
#define TWI_SMR_SMHH_Pos                      _U_(3)                                               /**< (TWI_SMR) SMBus Host Header Position */
#define TWI_SMR_SMHH_Msk                      (_U_(0x1) << TWI_SMR_SMHH_Pos)                       /**< (TWI_SMR) SMBus Host Header Mask */
#define TWI_SMR_SMHH(value)                   (TWI_SMR_SMHH_Msk & ((value) << TWI_SMR_SMHH_Pos))  
#define TWI_SMR_SCLWSDIS_Pos                  _U_(6)                                               /**< (TWI_SMR) Clock Wait State Disable Position */
#define TWI_SMR_SCLWSDIS_Msk                  (_U_(0x1) << TWI_SMR_SCLWSDIS_Pos)                   /**< (TWI_SMR) Clock Wait State Disable Mask */
#define TWI_SMR_SCLWSDIS(value)               (TWI_SMR_SCLWSDIS_Msk & ((value) << TWI_SMR_SCLWSDIS_Pos))
#define TWI_SMR_MASK_Pos                      _U_(8)                                               /**< (TWI_SMR) Slave Address Mask Position */
#define TWI_SMR_MASK_Msk                      (_U_(0x7F) << TWI_SMR_MASK_Pos)                      /**< (TWI_SMR) Slave Address Mask Mask */
#define TWI_SMR_MASK(value)                   (TWI_SMR_MASK_Msk & ((value) << TWI_SMR_MASK_Pos))  
#define TWI_SMR_SADR_Pos                      _U_(16)                                              /**< (TWI_SMR) Slave Address Position */
#define TWI_SMR_SADR_Msk                      (_U_(0x7F) << TWI_SMR_SADR_Pos)                      /**< (TWI_SMR) Slave Address Mask */
#define TWI_SMR_SADR(value)                   (TWI_SMR_SADR_Msk & ((value) << TWI_SMR_SADR_Pos))  
#define TWI_SMR_SADR1EN_Pos                   _U_(28)                                              /**< (TWI_SMR) Slave Address 1 Enable Position */
#define TWI_SMR_SADR1EN_Msk                   (_U_(0x1) << TWI_SMR_SADR1EN_Pos)                    /**< (TWI_SMR) Slave Address 1 Enable Mask */
#define TWI_SMR_SADR1EN(value)                (TWI_SMR_SADR1EN_Msk & ((value) << TWI_SMR_SADR1EN_Pos))
#define TWI_SMR_SADR2EN_Pos                   _U_(29)                                              /**< (TWI_SMR) Slave Address 2 Enable Position */
#define TWI_SMR_SADR2EN_Msk                   (_U_(0x1) << TWI_SMR_SADR2EN_Pos)                    /**< (TWI_SMR) Slave Address 2 Enable Mask */
#define TWI_SMR_SADR2EN(value)                (TWI_SMR_SADR2EN_Msk & ((value) << TWI_SMR_SADR2EN_Pos))
#define TWI_SMR_SADR3EN_Pos                   _U_(30)                                              /**< (TWI_SMR) Slave Address 3 Enable Position */
#define TWI_SMR_SADR3EN_Msk                   (_U_(0x1) << TWI_SMR_SADR3EN_Pos)                    /**< (TWI_SMR) Slave Address 3 Enable Mask */
#define TWI_SMR_SADR3EN(value)                (TWI_SMR_SADR3EN_Msk & ((value) << TWI_SMR_SADR3EN_Pos))
#define TWI_SMR_DATAMEN_Pos                   _U_(31)                                              /**< (TWI_SMR) Data Matching Enable Position */
#define TWI_SMR_DATAMEN_Msk                   (_U_(0x1) << TWI_SMR_DATAMEN_Pos)                    /**< (TWI_SMR) Data Matching Enable Mask */
#define TWI_SMR_DATAMEN(value)                (TWI_SMR_DATAMEN_Msk & ((value) << TWI_SMR_DATAMEN_Pos))
#define TWI_SMR_Msk                           _U_(0xF07F7F4D)                                      /**< (TWI_SMR) Register Mask  */


/* -------- TWI_IADR : (TWI Offset: 0x0C) (R/W 32) Internal Address Register -------- */
#define TWI_IADR_IADR_Pos                     _U_(0)                                               /**< (TWI_IADR) Internal Address Position */
#define TWI_IADR_IADR_Msk                     (_U_(0xFFFFFF) << TWI_IADR_IADR_Pos)                 /**< (TWI_IADR) Internal Address Mask */
#define TWI_IADR_IADR(value)                  (TWI_IADR_IADR_Msk & ((value) << TWI_IADR_IADR_Pos))
#define TWI_IADR_Msk                          _U_(0x00FFFFFF)                                      /**< (TWI_IADR) Register Mask  */


