virtualabs/cutcutgo/src/packs/ATSAMG55J19_DFP/component/twi.h
/* -------- TWI_CWGR : (TWI Offset: 0x10) (R/W 32) Clock Waveform Generator Register -------- */
#define TWI_CWGR_CLDIV_Pos                    _U_(0)                                               /**< (TWI_CWGR) Clock Low Divider Position */
#define TWI_CWGR_CLDIV_Msk                    (_U_(0xFF) << TWI_CWGR_CLDIV_Pos)                    /**< (TWI_CWGR) Clock Low Divider Mask */
#define TWI_CWGR_CLDIV(value)                 (TWI_CWGR_CLDIV_Msk & ((value) << TWI_CWGR_CLDIV_Pos))
#define TWI_CWGR_CHDIV_Pos                    _U_(8)                                               /**< (TWI_CWGR) Clock High Divider Position */
#define TWI_CWGR_CHDIV_Msk                    (_U_(0xFF) << TWI_CWGR_CHDIV_Pos)                    /**< (TWI_CWGR) Clock High Divider Mask */
#define TWI_CWGR_CHDIV(value)                 (TWI_CWGR_CHDIV_Msk & ((value) << TWI_CWGR_CHDIV_Pos))
#define TWI_CWGR_CKDIV_Pos                    _U_(16)                                              /**< (TWI_CWGR) Clock Divider Position */
#define TWI_CWGR_CKDIV_Msk                    (_U_(0x7) << TWI_CWGR_CKDIV_Pos)                     /**< (TWI_CWGR) Clock Divider Mask */
#define TWI_CWGR_CKDIV(value)                 (TWI_CWGR_CKDIV_Msk & ((value) << TWI_CWGR_CKDIV_Pos))
#define TWI_CWGR_BRSRCCLK_Pos                 _U_(20)                                              /**< (TWI_CWGR) Bit Rate Source Clock Position */
#define TWI_CWGR_BRSRCCLK_Msk                 (_U_(0x1) << TWI_CWGR_BRSRCCLK_Pos)                  /**< (TWI_CWGR) Bit Rate Source Clock Mask */
#define TWI_CWGR_BRSRCCLK(value)              (TWI_CWGR_BRSRCCLK_Msk & ((value) << TWI_CWGR_BRSRCCLK_Pos))
#define   TWI_CWGR_BRSRCCLK_PERIPH_CLK_Val    _U_(0x0)                                             /**< (TWI_CWGR) The peripheral clock is the source clock for the bit rate generation.  */
#define   TWI_CWGR_BRSRCCLK_PCK_Val           _U_(0x1)                                             /**< (TWI_CWGR) Programmable clock is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock.  */
#define TWI_CWGR_BRSRCCLK_PERIPH_CLK          (TWI_CWGR_BRSRCCLK_PERIPH_CLK_Val << TWI_CWGR_BRSRCCLK_Pos) /**< (TWI_CWGR) The peripheral clock is the source clock for the bit rate generation. Position  */
#define TWI_CWGR_BRSRCCLK_PCK                 (TWI_CWGR_BRSRCCLK_PCK_Val << TWI_CWGR_BRSRCCLK_Pos) /**< (TWI_CWGR) Programmable clock is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock. Position  */
#define TWI_CWGR_HOLD_Pos                     _U_(24)                                              /**< (TWI_CWGR) TWD Hold Time Versus TWCK Falling Position */
#define TWI_CWGR_HOLD_Msk                     (_U_(0x1F) << TWI_CWGR_HOLD_Pos)                     /**< (TWI_CWGR) TWD Hold Time Versus TWCK Falling Mask */
#define TWI_CWGR_HOLD(value)                  (TWI_CWGR_HOLD_Msk & ((value) << TWI_CWGR_HOLD_Pos))
#define TWI_CWGR_Msk                          _U_(0x1F17FFFF)                                      /**< (TWI_CWGR) Register Mask  */


/* -------- TWI_SR : (TWI Offset: 0x20) ( R/ 32) Status Register -------- */
#define TWI_SR_TXCOMP_Pos                     _U_(0)                                               /**< (TWI_SR) Transmission Completed (cleared by writing TWI_THR) Position */
#define TWI_SR_TXCOMP_Msk                     (_U_(0x1) << TWI_SR_TXCOMP_Pos)                      /**< (TWI_SR) Transmission Completed (cleared by writing TWI_THR) Mask */
#define TWI_SR_TXCOMP(value)                  (TWI_SR_TXCOMP_Msk & ((value) << TWI_SR_TXCOMP_Pos))
#define TWI_SR_RXRDY_Pos                      _U_(1)                                               /**< (TWI_SR) Receive Holding Register Ready (cleared when reading TWI_RHR) Position */
#define TWI_SR_RXRDY_Msk                      (_U_(0x1) << TWI_SR_RXRDY_Pos)                       /**< (TWI_SR) Receive Holding Register Ready (cleared when reading TWI_RHR) Mask */
#define TWI_SR_RXRDY(value)                   (TWI_SR_RXRDY_Msk & ((value) << TWI_SR_RXRDY_Pos))  
#define TWI_SR_TXRDY_Pos                      _U_(2)                                               /**< (TWI_SR) Transmit Holding Register Ready (cleared by writing TWI_THR) Position */
#define TWI_SR_TXRDY_Msk                      (_U_(0x1) << TWI_SR_TXRDY_Pos)                       /**< (TWI_SR) Transmit Holding Register Ready (cleared by writing TWI_THR) Mask */
#define TWI_SR_TXRDY(value)                   (TWI_SR_TXRDY_Msk & ((value) << TWI_SR_TXRDY_Pos))  
#define TWI_SR_SVREAD_Pos                     _U_(3)                                               /**< (TWI_SR) Slave Read Position */
#define TWI_SR_SVREAD_Msk                     (_U_(0x1) << TWI_SR_SVREAD_Pos)                      /**< (TWI_SR) Slave Read Mask */
#define TWI_SR_SVREAD(value)                  (TWI_SR_SVREAD_Msk & ((value) << TWI_SR_SVREAD_Pos))
#define TWI_SR_SVACC_Pos                      _U_(4)                                               /**< (TWI_SR) Slave Access Position */
#define TWI_SR_SVACC_Msk                      (_U_(0x1) << TWI_SR_SVACC_Pos)                       /**< (TWI_SR) Slave Access Mask */
#define TWI_SR_SVACC(value)                   (TWI_SR_SVACC_Msk & ((value) << TWI_SR_SVACC_Pos))  
#define TWI_SR_GACC_Pos                       _U_(5)                                               /**< (TWI_SR) General Call Access (cleared on read) Position */
#define TWI_SR_GACC_Msk                       (_U_(0x1) << TWI_SR_GACC_Pos)                        /**< (TWI_SR) General Call Access (cleared on read) Mask */
#define TWI_SR_GACC(value)                    (TWI_SR_GACC_Msk & ((value) << TWI_SR_GACC_Pos))    
#define TWI_SR_OVRE_Pos                       _U_(6)                                               /**< (TWI_SR) Overrun Error (cleared on read) Position */
#define TWI_SR_OVRE_Msk                       (_U_(0x1) << TWI_SR_OVRE_Pos)                        /**< (TWI_SR) Overrun Error (cleared on read) Mask */
#define TWI_SR_OVRE(value)                    (TWI_SR_OVRE_Msk & ((value) << TWI_SR_OVRE_Pos))    
#define TWI_SR_UNRE_Pos                       _U_(7)                                               /**< (TWI_SR) Underrun Error (cleared on read) Position */
#define TWI_SR_UNRE_Msk                       (_U_(0x1) << TWI_SR_UNRE_Pos)                        /**< (TWI_SR) Underrun Error (cleared on read) Mask */
#define TWI_SR_UNRE(value)                    (TWI_SR_UNRE_Msk & ((value) << TWI_SR_UNRE_Pos))    
#define TWI_SR_NACK_Pos                       _U_(8)                                               /**< (TWI_SR) Not Acknowledged (cleared on read) Position */
#define TWI_SR_NACK_Msk                       (_U_(0x1) << TWI_SR_NACK_Pos)                        /**< (TWI_SR) Not Acknowledged (cleared on read) Mask */
#define TWI_SR_NACK(value)                    (TWI_SR_NACK_Msk & ((value) << TWI_SR_NACK_Pos))    
#define TWI_SR_ARBLST_Pos                     _U_(9)                                               /**< (TWI_SR) Arbitration Lost (cleared on read) Position */
#define TWI_SR_ARBLST_Msk                     (_U_(0x1) << TWI_SR_ARBLST_Pos)                      /**< (TWI_SR) Arbitration Lost (cleared on read) Mask */
#define TWI_SR_ARBLST(value)                  (TWI_SR_ARBLST_Msk & ((value) << TWI_SR_ARBLST_Pos))
#define TWI_SR_SCLWS_Pos                      _U_(10)                                              /**< (TWI_SR) Clock Wait State Position */
#define TWI_SR_SCLWS_Msk                      (_U_(0x1) << TWI_SR_SCLWS_Pos)                       /**< (TWI_SR) Clock Wait State Mask */
#define TWI_SR_SCLWS(value)                   (TWI_SR_SCLWS_Msk & ((value) << TWI_SR_SCLWS_Pos))  
#define TWI_SR_EOSACC_Pos                     _U_(11)                                              /**< (TWI_SR) End Of Slave Access (cleared on read) Position */
#define TWI_SR_EOSACC_Msk                     (_U_(0x1) << TWI_SR_EOSACC_Pos)                      /**< (TWI_SR) End Of Slave Access (cleared on read) Mask */
#define TWI_SR_EOSACC(value)                  (TWI_SR_EOSACC_Msk & ((value) << TWI_SR_EOSACC_Pos))
#define TWI_SR_ENDRX_Pos                      _U_(12)                                              /**< (TWI_SR) End of RX buffer (cleared by writing TWI_RCR or TWI_RNCR) Position */
#define TWI_SR_ENDRX_Msk                      (_U_(0x1) << TWI_SR_ENDRX_Pos)                       /**< (TWI_SR) End of RX buffer (cleared by writing TWI_RCR or TWI_RNCR) Mask */
#define TWI_SR_ENDRX(value)                   (TWI_SR_ENDRX_Msk & ((value) << TWI_SR_ENDRX_Pos))  
#define TWI_SR_ENDTX_Pos                      _U_(13)                                              /**< (TWI_SR) End of TX buffer (cleared by writing TWI_TCR or TWI_TNCR) Position */
#define TWI_SR_ENDTX_Msk                      (_U_(0x1) << TWI_SR_ENDTX_Pos)                       /**< (TWI_SR) End of TX buffer (cleared by writing TWI_TCR or TWI_TNCR) Mask */
#define TWI_SR_ENDTX(value)                   (TWI_SR_ENDTX_Msk & ((value) << TWI_SR_ENDTX_Pos))  
#define TWI_SR_RXBUFF_Pos                     _U_(14)                                              /**< (TWI_SR) RX Buffer Full (cleared by writing TWI_RCR or TWI_RNCR) Position */
#define TWI_SR_RXBUFF_Msk                     (_U_(0x1) << TWI_SR_RXBUFF_Pos)                      /**< (TWI_SR) RX Buffer Full (cleared by writing TWI_RCR or TWI_RNCR) Mask */
#define TWI_SR_RXBUFF(value)                  (TWI_SR_RXBUFF_Msk & ((value) << TWI_SR_RXBUFF_Pos))
#define TWI_SR_TXBUFE_Pos                     _U_(15)                                              /**< (TWI_SR) TX Buffer Empty (cleared by writing TWI_TCR or TWI_TNCR) Position */
#define TWI_SR_TXBUFE_Msk                     (_U_(0x1) << TWI_SR_TXBUFE_Pos)                      /**< (TWI_SR) TX Buffer Empty (cleared by writing TWI_TCR or TWI_TNCR) Mask */
#define TWI_SR_TXBUFE(value)                  (TWI_SR_TXBUFE_Msk & ((value) << TWI_SR_TXBUFE_Pos))
#define TWI_SR_MCACK_Pos                      _U_(16)                                              /**< (TWI_SR) Master Code Acknowledge (cleared on read) Position */
#define TWI_SR_MCACK_Msk                      (_U_(0x1) << TWI_SR_MCACK_Pos)                       /**< (TWI_SR) Master Code Acknowledge (cleared on read) Mask */
#define TWI_SR_MCACK(value)                   (TWI_SR_MCACK_Msk & ((value) << TWI_SR_MCACK_Pos))  
#define TWI_SR_TOUT_Pos                       _U_(18)                                              /**< (TWI_SR) Timeout Error (cleared on read) Position */
#define TWI_SR_TOUT_Msk                       (_U_(0x1) << TWI_SR_TOUT_Pos)                        /**< (TWI_SR) Timeout Error (cleared on read) Mask */
#define TWI_SR_TOUT(value)                    (TWI_SR_TOUT_Msk & ((value) << TWI_SR_TOUT_Pos))    
#define TWI_SR_PECERR_Pos                     _U_(19)                                              /**< (TWI_SR) PEC Error (cleared on read) Position */
#define TWI_SR_PECERR_Msk                     (_U_(0x1) << TWI_SR_PECERR_Pos)                      /**< (TWI_SR) PEC Error (cleared on read) Mask */
#define TWI_SR_PECERR(value)                  (TWI_SR_PECERR_Msk & ((value) << TWI_SR_PECERR_Pos))
#define TWI_SR_SMBDAM_Pos                     _U_(20)                                              /**< (TWI_SR) SMBus Default Address Match (cleared on read) Position */
#define TWI_SR_SMBDAM_Msk                     (_U_(0x1) << TWI_SR_SMBDAM_Pos)                      /**< (TWI_SR) SMBus Default Address Match (cleared on read) Mask */
#define TWI_SR_SMBDAM(value)                  (TWI_SR_SMBDAM_Msk & ((value) << TWI_SR_SMBDAM_Pos))
#define TWI_SR_SMBHHM_Pos                     _U_(21)                                              /**< (TWI_SR) SMBus Host Header Address Match (cleared on read) Position */
#define TWI_SR_SMBHHM_Msk                     (_U_(0x1) << TWI_SR_SMBHHM_Pos)                      /**< (TWI_SR) SMBus Host Header Address Match (cleared on read) Mask */
#define TWI_SR_SMBHHM(value)                  (TWI_SR_SMBHHM_Msk & ((value) << TWI_SR_SMBHHM_Pos))
#define TWI_SR_LOCK_Pos                       _U_(23)                                              /**< (TWI_SR) TWI Lock due to Frame Errors Position */
#define TWI_SR_LOCK_Msk                       (_U_(0x1) << TWI_SR_LOCK_Pos)                        /**< (TWI_SR) TWI Lock due to Frame Errors Mask */
#define TWI_SR_LOCK(value)                    (TWI_SR_LOCK_Msk & ((value) << TWI_SR_LOCK_Pos))    
#define TWI_SR_SCL_Pos                        _U_(24)                                              /**< (TWI_SR) SCL line value Position */
#define TWI_SR_SCL_Msk                        (_U_(0x1) << TWI_SR_SCL_Pos)                         /**< (TWI_SR) SCL line value Mask */
#define TWI_SR_SCL(value)                     (TWI_SR_SCL_Msk & ((value) << TWI_SR_SCL_Pos))      
#define TWI_SR_SDA_Pos                        _U_(25)                                              /**< (TWI_SR) SDA line value Position */
#define TWI_SR_SDA_Msk                        (_U_(0x1) << TWI_SR_SDA_Pos)                         /**< (TWI_SR) SDA line value Mask */
#define TWI_SR_SDA(value)                     (TWI_SR_SDA_Msk & ((value) << TWI_SR_SDA_Pos))      
#define TWI_SR_Msk                            _U_(0x03BDFFFF)                                      /**< (TWI_SR) Register Mask  */


/* -------- TWI_IER : (TWI Offset: 0x24) ( /W 32) Interrupt Enable Register -------- */
#define TWI_IER_TXCOMP_Pos                    _U_(0)                                               /**< (TWI_IER) Transmission Completed Interrupt Enable Position */
#define TWI_IER_TXCOMP_Msk                    (_U_(0x1) << TWI_IER_TXCOMP_Pos)                     /**< (TWI_IER) Transmission Completed Interrupt Enable Mask */
#define TWI_IER_TXCOMP(value)                 (TWI_IER_TXCOMP_Msk & ((value) << TWI_IER_TXCOMP_Pos))
#define TWI_IER_RXRDY_Pos                     _U_(1)                                               /**< (TWI_IER) Receive Holding Register Ready Interrupt Enable Position */
#define TWI_IER_RXRDY_Msk                     (_U_(0x1) << TWI_IER_RXRDY_Pos)                      /**< (TWI_IER) Receive Holding Register Ready Interrupt Enable Mask */
#define TWI_IER_RXRDY(value)                  (TWI_IER_RXRDY_Msk & ((value) << TWI_IER_RXRDY_Pos))
#define TWI_IER_TXRDY_Pos                     _U_(2)                                               /**< (TWI_IER) Transmit Holding Register Ready Interrupt Enable Position */
#define TWI_IER_TXRDY_Msk                     (_U_(0x1) << TWI_IER_TXRDY_Pos)                      /**< (TWI_IER) Transmit Holding Register Ready Interrupt Enable Mask */
#define TWI_IER_TXRDY(value)                  (TWI_IER_TXRDY_Msk & ((value) << TWI_IER_TXRDY_Pos))
#define TWI_IER_SVACC_Pos                     _U_(4)                                               /**< (TWI_IER) Slave Access Interrupt Enable Position */
#define TWI_IER_SVACC_Msk                     (_U_(0x1) << TWI_IER_SVACC_Pos)                      /**< (TWI_IER) Slave Access Interrupt Enable Mask */
#define TWI_IER_SVACC(value)                  (TWI_IER_SVACC_Msk & ((value) << TWI_IER_SVACC_Pos))
#define TWI_IER_GACC_Pos                      _U_(5)                                               /**< (TWI_IER) General Call Access Interrupt Enable Position */
#define TWI_IER_GACC_Msk                      (_U_(0x1) << TWI_IER_GACC_Pos)                       /**< (TWI_IER) General Call Access Interrupt Enable Mask */
#define TWI_IER_GACC(value)                   (TWI_IER_GACC_Msk & ((value) << TWI_IER_GACC_Pos))  
#define TWI_IER_OVRE_Pos                      _U_(6)                                               /**< (TWI_IER) Overrun Error Interrupt Enable Position */
#define TWI_IER_OVRE_Msk                      (_U_(0x1) << TWI_IER_OVRE_Pos)                       /**< (TWI_IER) Overrun Error Interrupt Enable Mask */
#define TWI_IER_OVRE(value)                   (TWI_IER_OVRE_Msk & ((value) << TWI_IER_OVRE_Pos))  
#define TWI_IER_UNRE_Pos                      _U_(7)                                               /**< (TWI_IER) Underrun Error Interrupt Enable Position */
#define TWI_IER_UNRE_Msk                      (_U_(0x1) << TWI_IER_UNRE_Pos)                       /**< (TWI_IER) Underrun Error Interrupt Enable Mask */
#define TWI_IER_UNRE(value)                   (TWI_IER_UNRE_Msk & ((value) << TWI_IER_UNRE_Pos))  
#define TWI_IER_NACK_Pos                      _U_(8)                                               /**< (TWI_IER) Not Acknowledge Interrupt Enable Position */
#define TWI_IER_NACK_Msk                      (_U_(0x1) << TWI_IER_NACK_Pos)                       /**< (TWI_IER) Not Acknowledge Interrupt Enable Mask */
#define TWI_IER_NACK(value)                   (TWI_IER_NACK_Msk & ((value) << TWI_IER_NACK_Pos))  
#define TWI_IER_ARBLST_Pos                    _U_(9)                                               /**< (TWI_IER) Arbitration Lost Interrupt Enable Position */
#define TWI_IER_ARBLST_Msk                    (_U_(0x1) << TWI_IER_ARBLST_Pos)                     /**< (TWI_IER) Arbitration Lost Interrupt Enable Mask */
#define TWI_IER_ARBLST(value)                 (TWI_IER_ARBLST_Msk & ((value) << TWI_IER_ARBLST_Pos))
#define TWI_IER_SCL_WS_Pos                    _U_(10)                                              /**< (TWI_IER) Clock Wait State Interrupt Enable Position */
#define TWI_IER_SCL_WS_Msk                    (_U_(0x1) << TWI_IER_SCL_WS_Pos)                     /**< (TWI_IER) Clock Wait State Interrupt Enable Mask */
#define TWI_IER_SCL_WS(value)                 (TWI_IER_SCL_WS_Msk & ((value) << TWI_IER_SCL_WS_Pos))
#define TWI_IER_EOSACC_Pos                    _U_(11)                                              /**< (TWI_IER) End Of Slave Access Interrupt Enable Position */
#define TWI_IER_EOSACC_Msk                    (_U_(0x1) << TWI_IER_EOSACC_Pos)                     /**< (TWI_IER) End Of Slave Access Interrupt Enable Mask */
#define TWI_IER_EOSACC(value)                 (TWI_IER_EOSACC_Msk & ((value) << TWI_IER_EOSACC_Pos))
#define TWI_IER_ENDRX_Pos                     _U_(12)                                              /**< (TWI_IER) End of Receive Buffer Interrupt Enable Position */
#define TWI_IER_ENDRX_Msk                     (_U_(0x1) << TWI_IER_ENDRX_Pos)                      /**< (TWI_IER) End of Receive Buffer Interrupt Enable Mask */
#define TWI_IER_ENDRX(value)                  (TWI_IER_ENDRX_Msk & ((value) << TWI_IER_ENDRX_Pos))
#define TWI_IER_ENDTX_Pos                     _U_(13)                                              /**< (TWI_IER) End of Transmit Buffer Interrupt Enable Position */
#define TWI_IER_ENDTX_Msk                     (_U_(0x1) << TWI_IER_ENDTX_Pos)                      /**< (TWI_IER) End of Transmit Buffer Interrupt Enable Mask */
#define TWI_IER_ENDTX(value)                  (TWI_IER_ENDTX_Msk & ((value) << TWI_IER_ENDTX_Pos))
#define TWI_IER_RXBUFF_Pos                    _U_(14)                                              /**< (TWI_IER) Receive Buffer Full Interrupt Enable Position */
#define TWI_IER_RXBUFF_Msk                    (_U_(0x1) << TWI_IER_RXBUFF_Pos)                     /**< (TWI_IER) Receive Buffer Full Interrupt Enable Mask */
#define TWI_IER_RXBUFF(value)                 (TWI_IER_RXBUFF_Msk & ((value) << TWI_IER_RXBUFF_Pos))
#define TWI_IER_TXBUFE_Pos                    _U_(15)                                              /**< (TWI_IER) Transmit Buffer Empty Interrupt Enable Position */
#define TWI_IER_TXBUFE_Msk                    (_U_(0x1) << TWI_IER_TXBUFE_Pos)                     /**< (TWI_IER) Transmit Buffer Empty Interrupt Enable Mask */
#define TWI_IER_TXBUFE(value)                 (TWI_IER_TXBUFE_Msk & ((value) << TWI_IER_TXBUFE_Pos))
#define TWI_IER_MCACK_Pos                     _U_(16)                                              /**< (TWI_IER) Master Code Acknowledge Interrupt Enable Position */
#define TWI_IER_MCACK_Msk                     (_U_(0x1) << TWI_IER_MCACK_Pos)                      /**< (TWI_IER) Master Code Acknowledge Interrupt Enable Mask */
#define TWI_IER_MCACK(value)                  (TWI_IER_MCACK_Msk & ((value) << TWI_IER_MCACK_Pos))
#define TWI_IER_TOUT_Pos                      _U_(18)                                              /**< (TWI_IER) Timeout Error Interrupt Enable Position */
#define TWI_IER_TOUT_Msk                      (_U_(0x1) << TWI_IER_TOUT_Pos)                       /**< (TWI_IER) Timeout Error Interrupt Enable Mask */
#define TWI_IER_TOUT(value)                   (TWI_IER_TOUT_Msk & ((value) << TWI_IER_TOUT_Pos))  
#define TWI_IER_PECERR_Pos                    _U_(19)                                              /**< (TWI_IER) PEC Error Interrupt Enable Position */
#define TWI_IER_PECERR_Msk                    (_U_(0x1) << TWI_IER_PECERR_Pos)                     /**< (TWI_IER) PEC Error Interrupt Enable Mask */
#define TWI_IER_PECERR(value)                 (TWI_IER_PECERR_Msk & ((value) << TWI_IER_PECERR_Pos))
#define TWI_IER_SMBDAM_Pos                    _U_(20)                                              /**< (TWI_IER) SMBus Default Address Match Interrupt Enable Position */
#define TWI_IER_SMBDAM_Msk                    (_U_(0x1) << TWI_IER_SMBDAM_Pos)                     /**< (TWI_IER) SMBus Default Address Match Interrupt Enable Mask */
#define TWI_IER_SMBDAM(value)                 (TWI_IER_SMBDAM_Msk & ((value) << TWI_IER_SMBDAM_Pos))
#define TWI_IER_SMBHHM_Pos                    _U_(21)                                              /**< (TWI_IER) SMBus Host Header Address Match Interrupt Enable Position */
#define TWI_IER_SMBHHM_Msk                    (_U_(0x1) << TWI_IER_SMBHHM_Pos)                     /**< (TWI_IER) SMBus Host Header Address Match Interrupt Enable Mask */
#define TWI_IER_SMBHHM(value)                 (TWI_IER_SMBHHM_Msk & ((value) << TWI_IER_SMBHHM_Pos))
#define TWI_IER_Msk                           _U_(0x003DFFF7)                                      /**< (TWI_IER) Register Mask  */


