virtualabs/cutcutgo/src/packs/ATSAMG55J19_DFP/component/twi.h
/* -------- TWI_IDR : (TWI Offset: 0x28) ( /W 32) Interrupt Disable Register -------- */
#define TWI_IDR_TXCOMP_Pos                    _U_(0)                                               /**< (TWI_IDR) Transmission Completed Interrupt Disable Position */
#define TWI_IDR_TXCOMP_Msk                    (_U_(0x1) << TWI_IDR_TXCOMP_Pos)                     /**< (TWI_IDR) Transmission Completed Interrupt Disable Mask */
#define TWI_IDR_TXCOMP(value)                 (TWI_IDR_TXCOMP_Msk & ((value) << TWI_IDR_TXCOMP_Pos))
#define TWI_IDR_RXRDY_Pos                     _U_(1)                                               /**< (TWI_IDR) Receive Holding Register Ready Interrupt Disable Position */
#define TWI_IDR_RXRDY_Msk                     (_U_(0x1) << TWI_IDR_RXRDY_Pos)                      /**< (TWI_IDR) Receive Holding Register Ready Interrupt Disable Mask */
#define TWI_IDR_RXRDY(value)                  (TWI_IDR_RXRDY_Msk & ((value) << TWI_IDR_RXRDY_Pos))
#define TWI_IDR_TXRDY_Pos                     _U_(2)                                               /**< (TWI_IDR) Transmit Holding Register Ready Interrupt Disable Position */
#define TWI_IDR_TXRDY_Msk                     (_U_(0x1) << TWI_IDR_TXRDY_Pos)                      /**< (TWI_IDR) Transmit Holding Register Ready Interrupt Disable Mask */
#define TWI_IDR_TXRDY(value)                  (TWI_IDR_TXRDY_Msk & ((value) << TWI_IDR_TXRDY_Pos))
#define TWI_IDR_SVACC_Pos                     _U_(4)                                               /**< (TWI_IDR) Slave Access Interrupt Disable Position */
#define TWI_IDR_SVACC_Msk                     (_U_(0x1) << TWI_IDR_SVACC_Pos)                      /**< (TWI_IDR) Slave Access Interrupt Disable Mask */
#define TWI_IDR_SVACC(value)                  (TWI_IDR_SVACC_Msk & ((value) << TWI_IDR_SVACC_Pos))
#define TWI_IDR_GACC_Pos                      _U_(5)                                               /**< (TWI_IDR) General Call Access Interrupt Disable Position */
#define TWI_IDR_GACC_Msk                      (_U_(0x1) << TWI_IDR_GACC_Pos)                       /**< (TWI_IDR) General Call Access Interrupt Disable Mask */
#define TWI_IDR_GACC(value)                   (TWI_IDR_GACC_Msk & ((value) << TWI_IDR_GACC_Pos))  
#define TWI_IDR_OVRE_Pos                      _U_(6)                                               /**< (TWI_IDR) Overrun Error Interrupt Disable Position */
#define TWI_IDR_OVRE_Msk                      (_U_(0x1) << TWI_IDR_OVRE_Pos)                       /**< (TWI_IDR) Overrun Error Interrupt Disable Mask */
#define TWI_IDR_OVRE(value)                   (TWI_IDR_OVRE_Msk & ((value) << TWI_IDR_OVRE_Pos))  
#define TWI_IDR_UNRE_Pos                      _U_(7)                                               /**< (TWI_IDR) Underrun Error Interrupt Disable Position */
#define TWI_IDR_UNRE_Msk                      (_U_(0x1) << TWI_IDR_UNRE_Pos)                       /**< (TWI_IDR) Underrun Error Interrupt Disable Mask */
#define TWI_IDR_UNRE(value)                   (TWI_IDR_UNRE_Msk & ((value) << TWI_IDR_UNRE_Pos))  
#define TWI_IDR_NACK_Pos                      _U_(8)                                               /**< (TWI_IDR) Not Acknowledge Interrupt Disable Position */
#define TWI_IDR_NACK_Msk                      (_U_(0x1) << TWI_IDR_NACK_Pos)                       /**< (TWI_IDR) Not Acknowledge Interrupt Disable Mask */
#define TWI_IDR_NACK(value)                   (TWI_IDR_NACK_Msk & ((value) << TWI_IDR_NACK_Pos))  
#define TWI_IDR_ARBLST_Pos                    _U_(9)                                               /**< (TWI_IDR) Arbitration Lost Interrupt Disable Position */
#define TWI_IDR_ARBLST_Msk                    (_U_(0x1) << TWI_IDR_ARBLST_Pos)                     /**< (TWI_IDR) Arbitration Lost Interrupt Disable Mask */
#define TWI_IDR_ARBLST(value)                 (TWI_IDR_ARBLST_Msk & ((value) << TWI_IDR_ARBLST_Pos))
#define TWI_IDR_SCL_WS_Pos                    _U_(10)                                              /**< (TWI_IDR) Clock Wait State Interrupt Disable Position */
#define TWI_IDR_SCL_WS_Msk                    (_U_(0x1) << TWI_IDR_SCL_WS_Pos)                     /**< (TWI_IDR) Clock Wait State Interrupt Disable Mask */
#define TWI_IDR_SCL_WS(value)                 (TWI_IDR_SCL_WS_Msk & ((value) << TWI_IDR_SCL_WS_Pos))
#define TWI_IDR_EOSACC_Pos                    _U_(11)                                              /**< (TWI_IDR) End Of Slave Access Interrupt Disable Position */
#define TWI_IDR_EOSACC_Msk                    (_U_(0x1) << TWI_IDR_EOSACC_Pos)                     /**< (TWI_IDR) End Of Slave Access Interrupt Disable Mask */
#define TWI_IDR_EOSACC(value)                 (TWI_IDR_EOSACC_Msk & ((value) << TWI_IDR_EOSACC_Pos))
#define TWI_IDR_ENDRX_Pos                     _U_(12)                                              /**< (TWI_IDR) End of Receive Buffer Interrupt Disable Position */
#define TWI_IDR_ENDRX_Msk                     (_U_(0x1) << TWI_IDR_ENDRX_Pos)                      /**< (TWI_IDR) End of Receive Buffer Interrupt Disable Mask */
#define TWI_IDR_ENDRX(value)                  (TWI_IDR_ENDRX_Msk & ((value) << TWI_IDR_ENDRX_Pos))
#define TWI_IDR_ENDTX_Pos                     _U_(13)                                              /**< (TWI_IDR) End of Transmit Buffer Interrupt Disable Position */
#define TWI_IDR_ENDTX_Msk                     (_U_(0x1) << TWI_IDR_ENDTX_Pos)                      /**< (TWI_IDR) End of Transmit Buffer Interrupt Disable Mask */
#define TWI_IDR_ENDTX(value)                  (TWI_IDR_ENDTX_Msk & ((value) << TWI_IDR_ENDTX_Pos))
#define TWI_IDR_RXBUFF_Pos                    _U_(14)                                              /**< (TWI_IDR) Receive Buffer Full Interrupt Disable Position */
#define TWI_IDR_RXBUFF_Msk                    (_U_(0x1) << TWI_IDR_RXBUFF_Pos)                     /**< (TWI_IDR) Receive Buffer Full Interrupt Disable Mask */
#define TWI_IDR_RXBUFF(value)                 (TWI_IDR_RXBUFF_Msk & ((value) << TWI_IDR_RXBUFF_Pos))
#define TWI_IDR_TXBUFE_Pos                    _U_(15)                                              /**< (TWI_IDR) Transmit Buffer Empty Interrupt Disable Position */
#define TWI_IDR_TXBUFE_Msk                    (_U_(0x1) << TWI_IDR_TXBUFE_Pos)                     /**< (TWI_IDR) Transmit Buffer Empty Interrupt Disable Mask */
#define TWI_IDR_TXBUFE(value)                 (TWI_IDR_TXBUFE_Msk & ((value) << TWI_IDR_TXBUFE_Pos))
#define TWI_IDR_MCACK_Pos                     _U_(16)                                              /**< (TWI_IDR) Master Code Acknowledge Interrupt Disable Position */
#define TWI_IDR_MCACK_Msk                     (_U_(0x1) << TWI_IDR_MCACK_Pos)                      /**< (TWI_IDR) Master Code Acknowledge Interrupt Disable Mask */
#define TWI_IDR_MCACK(value)                  (TWI_IDR_MCACK_Msk & ((value) << TWI_IDR_MCACK_Pos))
#define TWI_IDR_TOUT_Pos                      _U_(18)                                              /**< (TWI_IDR) Timeout Error Interrupt Disable Position */
#define TWI_IDR_TOUT_Msk                      (_U_(0x1) << TWI_IDR_TOUT_Pos)                       /**< (TWI_IDR) Timeout Error Interrupt Disable Mask */
#define TWI_IDR_TOUT(value)                   (TWI_IDR_TOUT_Msk & ((value) << TWI_IDR_TOUT_Pos))  
#define TWI_IDR_PECERR_Pos                    _U_(19)                                              /**< (TWI_IDR) PEC Error Interrupt Disable Position */
#define TWI_IDR_PECERR_Msk                    (_U_(0x1) << TWI_IDR_PECERR_Pos)                     /**< (TWI_IDR) PEC Error Interrupt Disable Mask */
#define TWI_IDR_PECERR(value)                 (TWI_IDR_PECERR_Msk & ((value) << TWI_IDR_PECERR_Pos))
#define TWI_IDR_SMBDAM_Pos                    _U_(20)                                              /**< (TWI_IDR) SMBus Default Address Match Interrupt Disable Position */
#define TWI_IDR_SMBDAM_Msk                    (_U_(0x1) << TWI_IDR_SMBDAM_Pos)                     /**< (TWI_IDR) SMBus Default Address Match Interrupt Disable Mask */
#define TWI_IDR_SMBDAM(value)                 (TWI_IDR_SMBDAM_Msk & ((value) << TWI_IDR_SMBDAM_Pos))
#define TWI_IDR_SMBHHM_Pos                    _U_(21)                                              /**< (TWI_IDR) SMBus Host Header Address Match Interrupt Disable Position */
#define TWI_IDR_SMBHHM_Msk                    (_U_(0x1) << TWI_IDR_SMBHHM_Pos)                     /**< (TWI_IDR) SMBus Host Header Address Match Interrupt Disable Mask */
#define TWI_IDR_SMBHHM(value)                 (TWI_IDR_SMBHHM_Msk & ((value) << TWI_IDR_SMBHHM_Pos))
#define TWI_IDR_Msk                           _U_(0x003DFFF7)                                      /**< (TWI_IDR) Register Mask  */


/* -------- TWI_IMR : (TWI Offset: 0x2C) ( R/ 32) Interrupt Mask Register -------- */
#define TWI_IMR_TXCOMP_Pos                    _U_(0)                                               /**< (TWI_IMR) Transmission Completed Interrupt Mask Position */
#define TWI_IMR_TXCOMP_Msk                    (_U_(0x1) << TWI_IMR_TXCOMP_Pos)                     /**< (TWI_IMR) Transmission Completed Interrupt Mask Mask */
#define TWI_IMR_TXCOMP(value)                 (TWI_IMR_TXCOMP_Msk & ((value) << TWI_IMR_TXCOMP_Pos))
#define TWI_IMR_RXRDY_Pos                     _U_(1)                                               /**< (TWI_IMR) Receive Holding Register Ready Interrupt Mask Position */
#define TWI_IMR_RXRDY_Msk                     (_U_(0x1) << TWI_IMR_RXRDY_Pos)                      /**< (TWI_IMR) Receive Holding Register Ready Interrupt Mask Mask */
#define TWI_IMR_RXRDY(value)                  (TWI_IMR_RXRDY_Msk & ((value) << TWI_IMR_RXRDY_Pos))
#define TWI_IMR_TXRDY_Pos                     _U_(2)                                               /**< (TWI_IMR) Transmit Holding Register Ready Interrupt Mask Position */
#define TWI_IMR_TXRDY_Msk                     (_U_(0x1) << TWI_IMR_TXRDY_Pos)                      /**< (TWI_IMR) Transmit Holding Register Ready Interrupt Mask Mask */
#define TWI_IMR_TXRDY(value)                  (TWI_IMR_TXRDY_Msk & ((value) << TWI_IMR_TXRDY_Pos))
#define TWI_IMR_SVACC_Pos                     _U_(4)                                               /**< (TWI_IMR) Slave Access Interrupt Mask Position */
#define TWI_IMR_SVACC_Msk                     (_U_(0x1) << TWI_IMR_SVACC_Pos)                      /**< (TWI_IMR) Slave Access Interrupt Mask Mask */
#define TWI_IMR_SVACC(value)                  (TWI_IMR_SVACC_Msk & ((value) << TWI_IMR_SVACC_Pos))
#define TWI_IMR_GACC_Pos                      _U_(5)                                               /**< (TWI_IMR) General Call Access Interrupt Mask Position */
#define TWI_IMR_GACC_Msk                      (_U_(0x1) << TWI_IMR_GACC_Pos)                       /**< (TWI_IMR) General Call Access Interrupt Mask Mask */
#define TWI_IMR_GACC(value)                   (TWI_IMR_GACC_Msk & ((value) << TWI_IMR_GACC_Pos))  
#define TWI_IMR_OVRE_Pos                      _U_(6)                                               /**< (TWI_IMR) Overrun Error Interrupt Mask Position */
#define TWI_IMR_OVRE_Msk                      (_U_(0x1) << TWI_IMR_OVRE_Pos)                       /**< (TWI_IMR) Overrun Error Interrupt Mask Mask */
#define TWI_IMR_OVRE(value)                   (TWI_IMR_OVRE_Msk & ((value) << TWI_IMR_OVRE_Pos))  
#define TWI_IMR_UNRE_Pos                      _U_(7)                                               /**< (TWI_IMR) Underrun Error Interrupt Mask Position */
#define TWI_IMR_UNRE_Msk                      (_U_(0x1) << TWI_IMR_UNRE_Pos)                       /**< (TWI_IMR) Underrun Error Interrupt Mask Mask */
#define TWI_IMR_UNRE(value)                   (TWI_IMR_UNRE_Msk & ((value) << TWI_IMR_UNRE_Pos))  
#define TWI_IMR_NACK_Pos                      _U_(8)                                               /**< (TWI_IMR) Not Acknowledge Interrupt Mask Position */
#define TWI_IMR_NACK_Msk                      (_U_(0x1) << TWI_IMR_NACK_Pos)                       /**< (TWI_IMR) Not Acknowledge Interrupt Mask Mask */
#define TWI_IMR_NACK(value)                   (TWI_IMR_NACK_Msk & ((value) << TWI_IMR_NACK_Pos))  
#define TWI_IMR_ARBLST_Pos                    _U_(9)                                               /**< (TWI_IMR) Arbitration Lost Interrupt Mask Position */
#define TWI_IMR_ARBLST_Msk                    (_U_(0x1) << TWI_IMR_ARBLST_Pos)                     /**< (TWI_IMR) Arbitration Lost Interrupt Mask Mask */
#define TWI_IMR_ARBLST(value)                 (TWI_IMR_ARBLST_Msk & ((value) << TWI_IMR_ARBLST_Pos))
#define TWI_IMR_SCL_WS_Pos                    _U_(10)                                              /**< (TWI_IMR) Clock Wait State Interrupt Mask Position */
#define TWI_IMR_SCL_WS_Msk                    (_U_(0x1) << TWI_IMR_SCL_WS_Pos)                     /**< (TWI_IMR) Clock Wait State Interrupt Mask Mask */
#define TWI_IMR_SCL_WS(value)                 (TWI_IMR_SCL_WS_Msk & ((value) << TWI_IMR_SCL_WS_Pos))
#define TWI_IMR_EOSACC_Pos                    _U_(11)                                              /**< (TWI_IMR) End Of Slave Access Interrupt Mask Position */
#define TWI_IMR_EOSACC_Msk                    (_U_(0x1) << TWI_IMR_EOSACC_Pos)                     /**< (TWI_IMR) End Of Slave Access Interrupt Mask Mask */
#define TWI_IMR_EOSACC(value)                 (TWI_IMR_EOSACC_Msk & ((value) << TWI_IMR_EOSACC_Pos))
#define TWI_IMR_ENDRX_Pos                     _U_(12)                                              /**< (TWI_IMR) End of Receive Buffer Interrupt Mask Position */
#define TWI_IMR_ENDRX_Msk                     (_U_(0x1) << TWI_IMR_ENDRX_Pos)                      /**< (TWI_IMR) End of Receive Buffer Interrupt Mask Mask */
#define TWI_IMR_ENDRX(value)                  (TWI_IMR_ENDRX_Msk & ((value) << TWI_IMR_ENDRX_Pos))
#define TWI_IMR_ENDTX_Pos                     _U_(13)                                              /**< (TWI_IMR) End of Transmit Buffer Interrupt Mask Position */
#define TWI_IMR_ENDTX_Msk                     (_U_(0x1) << TWI_IMR_ENDTX_Pos)                      /**< (TWI_IMR) End of Transmit Buffer Interrupt Mask Mask */
#define TWI_IMR_ENDTX(value)                  (TWI_IMR_ENDTX_Msk & ((value) << TWI_IMR_ENDTX_Pos))
#define TWI_IMR_RXBUFF_Pos                    _U_(14)                                              /**< (TWI_IMR) Receive Buffer Full Interrupt Mask Position */
#define TWI_IMR_RXBUFF_Msk                    (_U_(0x1) << TWI_IMR_RXBUFF_Pos)                     /**< (TWI_IMR) Receive Buffer Full Interrupt Mask Mask */
#define TWI_IMR_RXBUFF(value)                 (TWI_IMR_RXBUFF_Msk & ((value) << TWI_IMR_RXBUFF_Pos))
#define TWI_IMR_TXBUFE_Pos                    _U_(15)                                              /**< (TWI_IMR) Transmit Buffer Empty Interrupt Mask Position */
#define TWI_IMR_TXBUFE_Msk                    (_U_(0x1) << TWI_IMR_TXBUFE_Pos)                     /**< (TWI_IMR) Transmit Buffer Empty Interrupt Mask Mask */
#define TWI_IMR_TXBUFE(value)                 (TWI_IMR_TXBUFE_Msk & ((value) << TWI_IMR_TXBUFE_Pos))
#define TWI_IMR_MCACK_Pos                     _U_(16)                                              /**< (TWI_IMR) Master Code Acknowledge Interrupt Mask Position */
#define TWI_IMR_MCACK_Msk                     (_U_(0x1) << TWI_IMR_MCACK_Pos)                      /**< (TWI_IMR) Master Code Acknowledge Interrupt Mask Mask */
#define TWI_IMR_MCACK(value)                  (TWI_IMR_MCACK_Msk & ((value) << TWI_IMR_MCACK_Pos))
#define TWI_IMR_TOUT_Pos                      _U_(18)                                              /**< (TWI_IMR) Timeout Error Interrupt Mask Position */
#define TWI_IMR_TOUT_Msk                      (_U_(0x1) << TWI_IMR_TOUT_Pos)                       /**< (TWI_IMR) Timeout Error Interrupt Mask Mask */
#define TWI_IMR_TOUT(value)                   (TWI_IMR_TOUT_Msk & ((value) << TWI_IMR_TOUT_Pos))  
#define TWI_IMR_PECERR_Pos                    _U_(19)                                              /**< (TWI_IMR) PEC Error Interrupt Mask Position */
#define TWI_IMR_PECERR_Msk                    (_U_(0x1) << TWI_IMR_PECERR_Pos)                     /**< (TWI_IMR) PEC Error Interrupt Mask Mask */
#define TWI_IMR_PECERR(value)                 (TWI_IMR_PECERR_Msk & ((value) << TWI_IMR_PECERR_Pos))
#define TWI_IMR_SMBDAM_Pos                    _U_(20)                                              /**< (TWI_IMR) SMBus Default Address Match Interrupt Mask Position */
#define TWI_IMR_SMBDAM_Msk                    (_U_(0x1) << TWI_IMR_SMBDAM_Pos)                     /**< (TWI_IMR) SMBus Default Address Match Interrupt Mask Mask */
#define TWI_IMR_SMBDAM(value)                 (TWI_IMR_SMBDAM_Msk & ((value) << TWI_IMR_SMBDAM_Pos))
#define TWI_IMR_SMBHHM_Pos                    _U_(21)                                              /**< (TWI_IMR) SMBus Host Header Address Match Interrupt Mask Position */
#define TWI_IMR_SMBHHM_Msk                    (_U_(0x1) << TWI_IMR_SMBHHM_Pos)                     /**< (TWI_IMR) SMBus Host Header Address Match Interrupt Mask Mask */
#define TWI_IMR_SMBHHM(value)                 (TWI_IMR_SMBHHM_Msk & ((value) << TWI_IMR_SMBHHM_Pos))
#define TWI_IMR_Msk                           _U_(0x003DFFF7)                                      /**< (TWI_IMR) Register Mask  */


/* -------- TWI_RHR : (TWI Offset: 0x30) ( R/ 32) Receive Holding Register -------- */
#define TWI_RHR_RXDATA_Pos                    _U_(0)                                               /**< (TWI_RHR) Master or Slave Receive Holding Data Position */
#define TWI_RHR_RXDATA_Msk                    (_U_(0xFF) << TWI_RHR_RXDATA_Pos)                    /**< (TWI_RHR) Master or Slave Receive Holding Data Mask */
#define TWI_RHR_RXDATA(value)                 (TWI_RHR_RXDATA_Msk & ((value) << TWI_RHR_RXDATA_Pos))
#define TWI_RHR_Msk                           _U_(0x000000FF)                                      /**< (TWI_RHR) Register Mask  */


/* -------- TWI_THR : (TWI Offset: 0x34) ( /W 32) Transmit Holding Register -------- */
#define TWI_THR_TXDATA_Pos                    _U_(0)                                               /**< (TWI_THR) Master or Slave Transmit Holding Data Position */
#define TWI_THR_TXDATA_Msk                    (_U_(0xFF) << TWI_THR_TXDATA_Pos)                    /**< (TWI_THR) Master or Slave Transmit Holding Data Mask */
#define TWI_THR_TXDATA(value)                 (TWI_THR_TXDATA_Msk & ((value) << TWI_THR_TXDATA_Pos))
#define TWI_THR_Msk                           _U_(0x000000FF)                                      /**< (TWI_THR) Register Mask  */


/* -------- TWI_SMBTR : (TWI Offset: 0x38) (R/W 32) SMBus Timing Register -------- */
#define TWI_SMBTR_PRESC_Pos                   _U_(0)                                               /**< (TWI_SMBTR) SMBus Clock Prescaler Position */
#define TWI_SMBTR_PRESC_Msk                   (_U_(0xF) << TWI_SMBTR_PRESC_Pos)                    /**< (TWI_SMBTR) SMBus Clock Prescaler Mask */
#define TWI_SMBTR_PRESC(value)                (TWI_SMBTR_PRESC_Msk & ((value) << TWI_SMBTR_PRESC_Pos))
#define TWI_SMBTR_TLOWS_Pos                   _U_(8)                                               /**< (TWI_SMBTR) Slave Clock Stretch Maximum Cycles Position */
#define TWI_SMBTR_TLOWS_Msk                   (_U_(0xFF) << TWI_SMBTR_TLOWS_Pos)                   /**< (TWI_SMBTR) Slave Clock Stretch Maximum Cycles Mask */
#define TWI_SMBTR_TLOWS(value)                (TWI_SMBTR_TLOWS_Msk & ((value) << TWI_SMBTR_TLOWS_Pos))
#define TWI_SMBTR_TLOWM_Pos                   _U_(16)                                              /**< (TWI_SMBTR) Master Clock Stretch Maximum Cycles Position */
#define TWI_SMBTR_TLOWM_Msk                   (_U_(0xFF) << TWI_SMBTR_TLOWM_Pos)                   /**< (TWI_SMBTR) Master Clock Stretch Maximum Cycles Mask */
#define TWI_SMBTR_TLOWM(value)                (TWI_SMBTR_TLOWM_Msk & ((value) << TWI_SMBTR_TLOWM_Pos))
#define TWI_SMBTR_THMAX_Pos                   _U_(24)                                              /**< (TWI_SMBTR) Clock High Maximum Cycles Position */
#define TWI_SMBTR_THMAX_Msk                   (_U_(0xFF) << TWI_SMBTR_THMAX_Pos)                   /**< (TWI_SMBTR) Clock High Maximum Cycles Mask */
#define TWI_SMBTR_THMAX(value)                (TWI_SMBTR_THMAX_Msk & ((value) << TWI_SMBTR_THMAX_Pos))
#define TWI_SMBTR_Msk                         _U_(0xFFFFFF0F)                                      /**< (TWI_SMBTR) Register Mask  */


/* -------- TWI_ACR : (TWI Offset: 0x40) (R/W 32) Alternative Command Register -------- */
#define TWI_ACR_DATAL_Pos                     _U_(0)                                               /**< (TWI_ACR) Data Length Position */
#define TWI_ACR_DATAL_Msk                     (_U_(0xFF) << TWI_ACR_DATAL_Pos)                     /**< (TWI_ACR) Data Length Mask */
#define TWI_ACR_DATAL(value)                  (TWI_ACR_DATAL_Msk & ((value) << TWI_ACR_DATAL_Pos))
#define TWI_ACR_DIR_Pos                       _U_(8)                                               /**< (TWI_ACR) Transfer Direction Position */
#define TWI_ACR_DIR_Msk                       (_U_(0x1) << TWI_ACR_DIR_Pos)                        /**< (TWI_ACR) Transfer Direction Mask */
#define TWI_ACR_DIR(value)                    (TWI_ACR_DIR_Msk & ((value) << TWI_ACR_DIR_Pos))    
#define TWI_ACR_PEC_Pos                       _U_(9)                                               /**< (TWI_ACR) PEC Request (SMBus Mode only) Position */
#define TWI_ACR_PEC_Msk                       (_U_(0x1) << TWI_ACR_PEC_Pos)                        /**< (TWI_ACR) PEC Request (SMBus Mode only) Mask */
#define TWI_ACR_PEC(value)                    (TWI_ACR_PEC_Msk & ((value) << TWI_ACR_PEC_Pos))    
#define TWI_ACR_NDATAL_Pos                    _U_(16)                                              /**< (TWI_ACR) Next Data Length Position */
#define TWI_ACR_NDATAL_Msk                    (_U_(0xFF) << TWI_ACR_NDATAL_Pos)                    /**< (TWI_ACR) Next Data Length Mask */
#define TWI_ACR_NDATAL(value)                 (TWI_ACR_NDATAL_Msk & ((value) << TWI_ACR_NDATAL_Pos))
#define TWI_ACR_NDIR_Pos                      _U_(24)                                              /**< (TWI_ACR) Next Transfer Direction Position */
#define TWI_ACR_NDIR_Msk                      (_U_(0x1) << TWI_ACR_NDIR_Pos)                       /**< (TWI_ACR) Next Transfer Direction Mask */
#define TWI_ACR_NDIR(value)                   (TWI_ACR_NDIR_Msk & ((value) << TWI_ACR_NDIR_Pos))  
#define TWI_ACR_NPEC_Pos                      _U_(25)                                              /**< (TWI_ACR) Next PEC Request (SMBus Mode only) Position */
#define TWI_ACR_NPEC_Msk                      (_U_(0x1) << TWI_ACR_NPEC_Pos)                       /**< (TWI_ACR) Next PEC Request (SMBus Mode only) Mask */
#define TWI_ACR_NPEC(value)                   (TWI_ACR_NPEC_Msk & ((value) << TWI_ACR_NPEC_Pos))  
#define TWI_ACR_Msk                           _U_(0x03FF03FF)                                      /**< (TWI_ACR) Register Mask  */


