virtualabs/cutcutgo/src/packs/ATSAMG55J19_DFP/component/twi.h
/* -------- TWI_FILTR : (TWI Offset: 0x44) (R/W 32) Filter Register -------- */
#define TWI_FILTR_FILT_Pos                    _U_(0)                                               /**< (TWI_FILTR) RX Digital Filter Position */
#define TWI_FILTR_FILT_Msk                    (_U_(0x1) << TWI_FILTR_FILT_Pos)                     /**< (TWI_FILTR) RX Digital Filter Mask */
#define TWI_FILTR_FILT(value)                 (TWI_FILTR_FILT_Msk & ((value) << TWI_FILTR_FILT_Pos))
#define TWI_FILTR_PADFEN_Pos                  _U_(1)                                               /**< (TWI_FILTR) PAD Filter Enable Position */
#define TWI_FILTR_PADFEN_Msk                  (_U_(0x1) << TWI_FILTR_PADFEN_Pos)                   /**< (TWI_FILTR) PAD Filter Enable Mask */
#define TWI_FILTR_PADFEN(value)               (TWI_FILTR_PADFEN_Msk & ((value) << TWI_FILTR_PADFEN_Pos))
#define TWI_FILTR_PADFCFG_Pos                 _U_(2)                                               /**< (TWI_FILTR) PAD Filter Config Position */
#define TWI_FILTR_PADFCFG_Msk                 (_U_(0x1) << TWI_FILTR_PADFCFG_Pos)                  /**< (TWI_FILTR) PAD Filter Config Mask */
#define TWI_FILTR_PADFCFG(value)              (TWI_FILTR_PADFCFG_Msk & ((value) << TWI_FILTR_PADFCFG_Pos))
#define TWI_FILTR_THRES_Pos                   _U_(8)                                               /**< (TWI_FILTR) Digital Filter Threshold Position */
#define TWI_FILTR_THRES_Msk                   (_U_(0x7) << TWI_FILTR_THRES_Pos)                    /**< (TWI_FILTR) Digital Filter Threshold Mask */
#define TWI_FILTR_THRES(value)                (TWI_FILTR_THRES_Msk & ((value) << TWI_FILTR_THRES_Pos))
#define TWI_FILTR_Msk                         _U_(0x00000707)                                      /**< (TWI_FILTR) Register Mask  */


/* -------- TWI_SWMR : (TWI Offset: 0x4C) (R/W 32) SleepWalking Matching Register -------- */
#define TWI_SWMR_SADR1_Pos                    _U_(0)                                               /**< (TWI_SWMR) Slave Address 1 Position */
#define TWI_SWMR_SADR1_Msk                    (_U_(0x7F) << TWI_SWMR_SADR1_Pos)                    /**< (TWI_SWMR) Slave Address 1 Mask */
#define TWI_SWMR_SADR1(value)                 (TWI_SWMR_SADR1_Msk & ((value) << TWI_SWMR_SADR1_Pos))
#define TWI_SWMR_SADR2_Pos                    _U_(8)                                               /**< (TWI_SWMR) Slave Address 2 Position */
#define TWI_SWMR_SADR2_Msk                    (_U_(0x7F) << TWI_SWMR_SADR2_Pos)                    /**< (TWI_SWMR) Slave Address 2 Mask */
#define TWI_SWMR_SADR2(value)                 (TWI_SWMR_SADR2_Msk & ((value) << TWI_SWMR_SADR2_Pos))
#define TWI_SWMR_SADR3_Pos                    _U_(16)                                              /**< (TWI_SWMR) Slave Address 3 Position */
#define TWI_SWMR_SADR3_Msk                    (_U_(0x7F) << TWI_SWMR_SADR3_Pos)                    /**< (TWI_SWMR) Slave Address 3 Mask */
#define TWI_SWMR_SADR3(value)                 (TWI_SWMR_SADR3_Msk & ((value) << TWI_SWMR_SADR3_Pos))
#define TWI_SWMR_DATAM_Pos                    _U_(24)                                              /**< (TWI_SWMR) Data Match Position */
#define TWI_SWMR_DATAM_Msk                    (_U_(0xFF) << TWI_SWMR_DATAM_Pos)                    /**< (TWI_SWMR) Data Match Mask */
#define TWI_SWMR_DATAM(value)                 (TWI_SWMR_DATAM_Msk & ((value) << TWI_SWMR_DATAM_Pos))
#define TWI_SWMR_Msk                          _U_(0xFF7F7F7F)                                      /**< (TWI_SWMR) Register Mask  */


/* -------- TWI_WPMR : (TWI Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define TWI_WPMR_WPEN_Pos                     _U_(0)                                               /**< (TWI_WPMR) Write Protection Enable Position */
#define TWI_WPMR_WPEN_Msk                     (_U_(0x1) << TWI_WPMR_WPEN_Pos)                      /**< (TWI_WPMR) Write Protection Enable Mask */
#define TWI_WPMR_WPEN(value)                  (TWI_WPMR_WPEN_Msk & ((value) << TWI_WPMR_WPEN_Pos))
#define TWI_WPMR_WPKEY_Pos                    _U_(8)                                               /**< (TWI_WPMR) Write Protection Key Position */
#define TWI_WPMR_WPKEY_Msk                    (_U_(0xFFFFFF) << TWI_WPMR_WPKEY_Pos)                /**< (TWI_WPMR) Write Protection Key Mask */
#define TWI_WPMR_WPKEY(value)                 (TWI_WPMR_WPKEY_Msk & ((value) << TWI_WPMR_WPKEY_Pos))
#define   TWI_WPMR_WPKEY_PASSWD_Val           _U_(0x545749)                                        /**< (TWI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0  */
#define TWI_WPMR_WPKEY_PASSWD                 (TWI_WPMR_WPKEY_PASSWD_Val << TWI_WPMR_WPKEY_Pos)    /**< (TWI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0 Position  */
#define TWI_WPMR_Msk                          _U_(0xFFFFFF01)                                      /**< (TWI_WPMR) Register Mask  */


/* -------- TWI_WPSR : (TWI Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define TWI_WPSR_WPVS_Pos                     _U_(0)                                               /**< (TWI_WPSR) Write Protection Violation Status Position */
#define TWI_WPSR_WPVS_Msk                     (_U_(0x1) << TWI_WPSR_WPVS_Pos)                      /**< (TWI_WPSR) Write Protection Violation Status Mask */
#define TWI_WPSR_WPVS(value)                  (TWI_WPSR_WPVS_Msk & ((value) << TWI_WPSR_WPVS_Pos))
#define TWI_WPSR_WPVSRC_Pos                   _U_(8)                                               /**< (TWI_WPSR) Write Protection Violation Source Position */
#define TWI_WPSR_WPVSRC_Msk                   (_U_(0xFFFFFF) << TWI_WPSR_WPVSRC_Pos)               /**< (TWI_WPSR) Write Protection Violation Source Mask */
#define TWI_WPSR_WPVSRC(value)                (TWI_WPSR_WPVSRC_Msk & ((value) << TWI_WPSR_WPVSRC_Pos))
#define TWI_WPSR_Msk                          _U_(0xFFFFFF01)                                      /**< (TWI_WPSR) Register Mask  */


