virtualabs/cutcutgo/src/packs/ATSAMG55J19_DFP/component/twi.h
/* -------- TWI_RPR : (TWI Offset: 0x100) (R/W 32) Receive Pointer Register -------- */
#define TWI_RPR_RXPTR_Pos                     _U_(0)                                               /**< (TWI_RPR) Receive Pointer Register Position */
#define TWI_RPR_RXPTR_Msk                     (_U_(0xFFFFFFFF) << TWI_RPR_RXPTR_Pos)               /**< (TWI_RPR) Receive Pointer Register Mask */
#define TWI_RPR_RXPTR(value)                  (TWI_RPR_RXPTR_Msk & ((value) << TWI_RPR_RXPTR_Pos))
#define TWI_RPR_Msk                           _U_(0xFFFFFFFF)                                      /**< (TWI_RPR) Register Mask  */


/* -------- TWI_RCR : (TWI Offset: 0x104) (R/W 32) Receive Counter Register -------- */
#define TWI_RCR_RXCTR_Pos                     _U_(0)                                               /**< (TWI_RCR) Receive Counter Register Position */
#define TWI_RCR_RXCTR_Msk                     (_U_(0xFFFF) << TWI_RCR_RXCTR_Pos)                   /**< (TWI_RCR) Receive Counter Register Mask */
#define TWI_RCR_RXCTR(value)                  (TWI_RCR_RXCTR_Msk & ((value) << TWI_RCR_RXCTR_Pos))
#define TWI_RCR_Msk                           _U_(0x0000FFFF)                                      /**< (TWI_RCR) Register Mask  */


/* -------- TWI_TPR : (TWI Offset: 0x108) (R/W 32) Transmit Pointer Register -------- */
#define TWI_TPR_TXPTR_Pos                     _U_(0)                                               /**< (TWI_TPR) Transmit Counter Register Position */
#define TWI_TPR_TXPTR_Msk                     (_U_(0xFFFFFFFF) << TWI_TPR_TXPTR_Pos)               /**< (TWI_TPR) Transmit Counter Register Mask */
#define TWI_TPR_TXPTR(value)                  (TWI_TPR_TXPTR_Msk & ((value) << TWI_TPR_TXPTR_Pos))
#define TWI_TPR_Msk                           _U_(0xFFFFFFFF)                                      /**< (TWI_TPR) Register Mask  */


/* -------- TWI_TCR : (TWI Offset: 0x10C) (R/W 32) Transmit Counter Register -------- */
#define TWI_TCR_TXCTR_Pos                     _U_(0)                                               /**< (TWI_TCR) Transmit Counter Register Position */
#define TWI_TCR_TXCTR_Msk                     (_U_(0xFFFF) << TWI_TCR_TXCTR_Pos)                   /**< (TWI_TCR) Transmit Counter Register Mask */
#define TWI_TCR_TXCTR(value)                  (TWI_TCR_TXCTR_Msk & ((value) << TWI_TCR_TXCTR_Pos))
#define TWI_TCR_Msk                           _U_(0x0000FFFF)                                      /**< (TWI_TCR) Register Mask  */


/* -------- TWI_RNPR : (TWI Offset: 0x110) (R/W 32) Receive Next Pointer Register -------- */
#define TWI_RNPR_RXNPTR_Pos                   _U_(0)                                               /**< (TWI_RNPR) Receive Next Pointer Position */
#define TWI_RNPR_RXNPTR_Msk                   (_U_(0xFFFFFFFF) << TWI_RNPR_RXNPTR_Pos)             /**< (TWI_RNPR) Receive Next Pointer Mask */
#define TWI_RNPR_RXNPTR(value)                (TWI_RNPR_RXNPTR_Msk & ((value) << TWI_RNPR_RXNPTR_Pos))
#define TWI_RNPR_Msk                          _U_(0xFFFFFFFF)                                      /**< (TWI_RNPR) Register Mask  */


/* -------- TWI_RNCR : (TWI Offset: 0x114) (R/W 32) Receive Next Counter Register -------- */
#define TWI_RNCR_RXNCTR_Pos                   _U_(0)                                               /**< (TWI_RNCR) Receive Next Counter Position */
#define TWI_RNCR_RXNCTR_Msk                   (_U_(0xFFFF) << TWI_RNCR_RXNCTR_Pos)                 /**< (TWI_RNCR) Receive Next Counter Mask */
#define TWI_RNCR_RXNCTR(value)                (TWI_RNCR_RXNCTR_Msk & ((value) << TWI_RNCR_RXNCTR_Pos))
#define TWI_RNCR_Msk                          _U_(0x0000FFFF)                                      /**< (TWI_RNCR) Register Mask  */


/* -------- TWI_TNPR : (TWI Offset: 0x118) (R/W 32) Transmit Next Pointer Register -------- */
#define TWI_TNPR_TXNPTR_Pos                   _U_(0)                                               /**< (TWI_TNPR) Transmit Next Pointer Position */
#define TWI_TNPR_TXNPTR_Msk                   (_U_(0xFFFFFFFF) << TWI_TNPR_TXNPTR_Pos)             /**< (TWI_TNPR) Transmit Next Pointer Mask */
#define TWI_TNPR_TXNPTR(value)                (TWI_TNPR_TXNPTR_Msk & ((value) << TWI_TNPR_TXNPTR_Pos))
#define TWI_TNPR_Msk                          _U_(0xFFFFFFFF)                                      /**< (TWI_TNPR) Register Mask  */


/* -------- TWI_TNCR : (TWI Offset: 0x11C) (R/W 32) Transmit Next Counter Register -------- */
#define TWI_TNCR_TXNCTR_Pos                   _U_(0)                                               /**< (TWI_TNCR) Transmit Counter Next Position */
#define TWI_TNCR_TXNCTR_Msk                   (_U_(0xFFFF) << TWI_TNCR_TXNCTR_Pos)                 /**< (TWI_TNCR) Transmit Counter Next Mask */
#define TWI_TNCR_TXNCTR(value)                (TWI_TNCR_TXNCTR_Msk & ((value) << TWI_TNCR_TXNCTR_Pos))
#define TWI_TNCR_Msk                          _U_(0x0000FFFF)                                      /**< (TWI_TNCR) Register Mask  */


/* -------- TWI_PTCR : (TWI Offset: 0x120) ( /W 32) Transfer Control Register -------- */
#define TWI_PTCR_RXTEN_Pos                    _U_(0)                                               /**< (TWI_PTCR) Receiver Transfer Enable Position */
#define TWI_PTCR_RXTEN_Msk                    (_U_(0x1) << TWI_PTCR_RXTEN_Pos)                     /**< (TWI_PTCR) Receiver Transfer Enable Mask */
#define TWI_PTCR_RXTEN(value)                 (TWI_PTCR_RXTEN_Msk & ((value) << TWI_PTCR_RXTEN_Pos))
#define TWI_PTCR_RXTDIS_Pos                   _U_(1)                                               /**< (TWI_PTCR) Receiver Transfer Disable Position */
#define TWI_PTCR_RXTDIS_Msk                   (_U_(0x1) << TWI_PTCR_RXTDIS_Pos)                    /**< (TWI_PTCR) Receiver Transfer Disable Mask */
#define TWI_PTCR_RXTDIS(value)                (TWI_PTCR_RXTDIS_Msk & ((value) << TWI_PTCR_RXTDIS_Pos))
#define TWI_PTCR_TXTEN_Pos                    _U_(8)                                               /**< (TWI_PTCR) Transmitter Transfer Enable Position */
#define TWI_PTCR_TXTEN_Msk                    (_U_(0x1) << TWI_PTCR_TXTEN_Pos)                     /**< (TWI_PTCR) Transmitter Transfer Enable Mask */
#define TWI_PTCR_TXTEN(value)                 (TWI_PTCR_TXTEN_Msk & ((value) << TWI_PTCR_TXTEN_Pos))
#define TWI_PTCR_TXTDIS_Pos                   _U_(9)                                               /**< (TWI_PTCR) Transmitter Transfer Disable Position */
#define TWI_PTCR_TXTDIS_Msk                   (_U_(0x1) << TWI_PTCR_TXTDIS_Pos)                    /**< (TWI_PTCR) Transmitter Transfer Disable Mask */
#define TWI_PTCR_TXTDIS(value)                (TWI_PTCR_TXTDIS_Msk & ((value) << TWI_PTCR_TXTDIS_Pos))
#define TWI_PTCR_RXCBEN_Pos                   _U_(16)                                              /**< (TWI_PTCR) Receiver Circular Buffer Enable Position */
#define TWI_PTCR_RXCBEN_Msk                   (_U_(0x1) << TWI_PTCR_RXCBEN_Pos)                    /**< (TWI_PTCR) Receiver Circular Buffer Enable Mask */
#define TWI_PTCR_RXCBEN(value)                (TWI_PTCR_RXCBEN_Msk & ((value) << TWI_PTCR_RXCBEN_Pos))
#define TWI_PTCR_RXCBDIS_Pos                  _U_(17)                                              /**< (TWI_PTCR) Receiver Circular Buffer Disable Position */
#define TWI_PTCR_RXCBDIS_Msk                  (_U_(0x1) << TWI_PTCR_RXCBDIS_Pos)                   /**< (TWI_PTCR) Receiver Circular Buffer Disable Mask */
#define TWI_PTCR_RXCBDIS(value)               (TWI_PTCR_RXCBDIS_Msk & ((value) << TWI_PTCR_RXCBDIS_Pos))
#define TWI_PTCR_TXCBEN_Pos                   _U_(18)                                              /**< (TWI_PTCR) Transmitter Circular Buffer Enable Position */
#define TWI_PTCR_TXCBEN_Msk                   (_U_(0x1) << TWI_PTCR_TXCBEN_Pos)                    /**< (TWI_PTCR) Transmitter Circular Buffer Enable Mask */
#define TWI_PTCR_TXCBEN(value)                (TWI_PTCR_TXCBEN_Msk & ((value) << TWI_PTCR_TXCBEN_Pos))
#define TWI_PTCR_TXCBDIS_Pos                  _U_(19)                                              /**< (TWI_PTCR) Transmitter Circular Buffer Disable Position */
#define TWI_PTCR_TXCBDIS_Msk                  (_U_(0x1) << TWI_PTCR_TXCBDIS_Pos)                   /**< (TWI_PTCR) Transmitter Circular Buffer Disable Mask */
#define TWI_PTCR_TXCBDIS(value)               (TWI_PTCR_TXCBDIS_Msk & ((value) << TWI_PTCR_TXCBDIS_Pos))
#define TWI_PTCR_ERRCLR_Pos                   _U_(24)                                              /**< (TWI_PTCR) Transfer Bus Error Clear Position */
#define TWI_PTCR_ERRCLR_Msk                   (_U_(0x1) << TWI_PTCR_ERRCLR_Pos)                    /**< (TWI_PTCR) Transfer Bus Error Clear Mask */
#define TWI_PTCR_ERRCLR(value)                (TWI_PTCR_ERRCLR_Msk & ((value) << TWI_PTCR_ERRCLR_Pos))
#define TWI_PTCR_Msk                          _U_(0x010F0303)                                      /**< (TWI_PTCR) Register Mask  */


/* -------- TWI_PTSR : (TWI Offset: 0x124) ( R/ 32) Transfer Status Register -------- */
#define TWI_PTSR_RXTEN_Pos                    _U_(0)                                               /**< (TWI_PTSR) Receiver Transfer Enable Position */
#define TWI_PTSR_RXTEN_Msk                    (_U_(0x1) << TWI_PTSR_RXTEN_Pos)                     /**< (TWI_PTSR) Receiver Transfer Enable Mask */
#define TWI_PTSR_RXTEN(value)                 (TWI_PTSR_RXTEN_Msk & ((value) << TWI_PTSR_RXTEN_Pos))
#define TWI_PTSR_TXTEN_Pos                    _U_(8)                                               /**< (TWI_PTSR) Transmitter Transfer Enable Position */
#define TWI_PTSR_TXTEN_Msk                    (_U_(0x1) << TWI_PTSR_TXTEN_Pos)                     /**< (TWI_PTSR) Transmitter Transfer Enable Mask */
#define TWI_PTSR_TXTEN(value)                 (TWI_PTSR_TXTEN_Msk & ((value) << TWI_PTSR_TXTEN_Pos))
#define TWI_PTSR_RXCBEN_Pos                   _U_(16)                                              /**< (TWI_PTSR) Receiver Circular Buffer Enable Position */
#define TWI_PTSR_RXCBEN_Msk                   (_U_(0x1) << TWI_PTSR_RXCBEN_Pos)                    /**< (TWI_PTSR) Receiver Circular Buffer Enable Mask */
#define TWI_PTSR_RXCBEN(value)                (TWI_PTSR_RXCBEN_Msk & ((value) << TWI_PTSR_RXCBEN_Pos))
#define TWI_PTSR_TXCBEN_Pos                   _U_(18)                                              /**< (TWI_PTSR) Transmitter Circular Buffer Enable Position */
#define TWI_PTSR_TXCBEN_Msk                   (_U_(0x1) << TWI_PTSR_TXCBEN_Pos)                    /**< (TWI_PTSR) Transmitter Circular Buffer Enable Mask */
#define TWI_PTSR_TXCBEN(value)                (TWI_PTSR_TXCBEN_Msk & ((value) << TWI_PTSR_TXCBEN_Pos))
#define TWI_PTSR_ERR_Pos                      _U_(24)                                              /**< (TWI_PTSR) Transfer Bus Error Position */
#define TWI_PTSR_ERR_Msk                      (_U_(0x1) << TWI_PTSR_ERR_Pos)                       /**< (TWI_PTSR) Transfer Bus Error Mask */
#define TWI_PTSR_ERR(value)                   (TWI_PTSR_ERR_Msk & ((value) << TWI_PTSR_ERR_Pos))  
#define TWI_PTSR_Msk                          _U_(0x01050101)                                      /**< (TWI_PTSR) Register Mask  */


/** \brief TWI register offsets definitions */
#define TWI_CR_REG_OFST                (0x00)              /**< (TWI_CR) Control Register Offset */
#define TWI_MMR_REG_OFST               (0x04)              /**< (TWI_MMR) Master Mode Register Offset */
#define TWI_SMR_REG_OFST               (0x08)              /**< (TWI_SMR) Slave Mode Register Offset */
#define TWI_IADR_REG_OFST              (0x0C)              /**< (TWI_IADR) Internal Address Register Offset */
#define TWI_CWGR_REG_OFST              (0x10)              /**< (TWI_CWGR) Clock Waveform Generator Register Offset */
#define TWI_SR_REG_OFST                (0x20)              /**< (TWI_SR) Status Register Offset */
#define TWI_IER_REG_OFST               (0x24)              /**< (TWI_IER) Interrupt Enable Register Offset */
#define TWI_IDR_REG_OFST               (0x28)              /**< (TWI_IDR) Interrupt Disable Register Offset */
#define TWI_IMR_REG_OFST               (0x2C)              /**< (TWI_IMR) Interrupt Mask Register Offset */
#define TWI_RHR_REG_OFST               (0x30)              /**< (TWI_RHR) Receive Holding Register Offset */
#define TWI_THR_REG_OFST               (0x34)              /**< (TWI_THR) Transmit Holding Register Offset */
#define TWI_SMBTR_REG_OFST             (0x38)              /**< (TWI_SMBTR) SMBus Timing Register Offset */
#define TWI_ACR_REG_OFST               (0x40)              /**< (TWI_ACR) Alternative Command Register Offset */
#define TWI_FILTR_REG_OFST             (0x44)              /**< (TWI_FILTR) Filter Register Offset */
#define TWI_SWMR_REG_OFST              (0x4C)              /**< (TWI_SWMR) SleepWalking Matching Register Offset */
#define TWI_WPMR_REG_OFST              (0xE4)              /**< (TWI_WPMR) Write Protection Mode Register Offset */
#define TWI_WPSR_REG_OFST              (0xE8)              /**< (TWI_WPSR) Write Protection Status Register Offset */
#define TWI_RPR_REG_OFST               (0x100)             /**< (TWI_RPR) Receive Pointer Register Offset */
#define TWI_RCR_REG_OFST               (0x104)             /**< (TWI_RCR) Receive Counter Register Offset */
#define TWI_TPR_REG_OFST               (0x108)             /**< (TWI_TPR) Transmit Pointer Register Offset */
#define TWI_TCR_REG_OFST               (0x10C)             /**< (TWI_TCR) Transmit Counter Register Offset */
#define TWI_RNPR_REG_OFST              (0x110)             /**< (TWI_RNPR) Receive Next Pointer Register Offset */
#define TWI_RNCR_REG_OFST              (0x114)             /**< (TWI_RNCR) Receive Next Counter Register Offset */
#define TWI_TNPR_REG_OFST              (0x118)             /**< (TWI_TNPR) Transmit Next Pointer Register Offset */
#define TWI_TNCR_REG_OFST              (0x11C)             /**< (TWI_TNCR) Transmit Next Counter Register Offset */
#define TWI_PTCR_REG_OFST              (0x120)             /**< (TWI_PTCR) Transfer Control Register Offset */
#define TWI_PTSR_REG_OFST              (0x124)             /**< (TWI_PTSR) Transfer Status Register Offset */

